Repository: ncdlek/a_master_of_go
Catalog: Localizations/*.lproj/Localizable.strings
Languages: tr

source: introduction
tr: "A Master of Go" is a Go AI with a strong neural network. You can play or study with "A Master of Go". Enjoy!

source: references
tr: Reference ・The app icon is "Zhong Kui” by Tsukioka Yoshitoshi(1839-1892). ・The AI algorithm is same as AlphaZero by DeepMind Technologies Limited. ・Powered by a neural network derived from Leela Zero, neural networks of ELF OpenGo (Authors: Yuandong Tian, et al. 2018, https://github.com/pytorch/ELF) and PhoenixGo (Authors: Qinsong Zeng, et al. 2018, https://github.com/Tencent/PhoenixGo). ・Information presentation in study mode is compatible with Lizzie(https://github.com/featurecat/lizzie).

source: end greeting
tr: Benimle oynadığınız için teşekkürler!

source: start greeting
tr: Let's play!

source: resign
tr: Your nice game!

source: pass
tr: I pass.

source: alert
tr: Message

source: unsupported board size
tr: The size(%@) is not supported.

source: invalid SGF
tr: It looks like an invalid SGF. %@

source: illegal move in SGF
tr: It looks like that there is an illegal move(%d).

source: trouble
tr: Sorry, AI seems to have trouble.

source: crash
tr: The AI ​​engine terminated abnormally. Please return to the main menu and try once. If repeated, please contact us from the support page. I am terribly sorry.

source: illegal move
tr: Here is an illegal move.

source: not text
tr: It doesn't look like a text file. UTF-8 is required as character code.

source: confirm file
tr: Open a file

source: confirm message
tr: Are you sure to abandon current game or study?

source: komi is not supported
tr: Komi is %.1f, but %.1f is adopted.

source: komi is not specified
tr: Komi is not specified, but %.1f is adopted.

source: going to resign
tr: You are going to resign

source: how to save
tr: (You can save this record via the share button in main menu)

source: sorry
tr: I am sorry

source: crash during game
tr: It seems that the app crashed during a game last time. You can retrieve the game SGF by the share button. Do you copy it into clipboard?

source: buying
tr: processing

source: bought
tr: The process finished. Thank you for purchasing! Now you have %d coins.

source: failed to buy
tr: I am sorry that the process could not finish.

source: invalid product IDs
tr: Invalid product IDs are detected.

source: no product IDs
tr: It seems that App Store is preparing items. Please wait for a while then try again.
